var SET_TYPES = ["冒险家", "悠古的磐岩", "战狂", "冰风迷途的勇士", "染血的骑士道",
    "勇士之心", "炽烈的炎之魔女", "深林的记忆", "守护之心", "沙上楼阁史话",
    "来歆余响", "绝缘之旗印", "深廊终曲", "乐园遗落之花", "谐律异想断章",
    "赌徒", "饰金之梦", "角斗士的终幕礼", "黄金剧团", "沉沦之心", "华馆梦醒形骸记",
    "教官", "渡过烈火的贤人", "长夜之誓", "幸运儿", "被怜爱的少女", "逐影猎人", "武人",
    "穹境示现之夜", "回声之林夜话", "昔日宗室之仪", "水仙之梦", "黑曜秘典", "海染砗磲",
    "苍白之火", "祭水之人", "祭火之人", "祭雷之人", "祭冰之人", "行者之心", "逆飞的流星",
    "学士", "烬城勇者绘卷", "追忆之注连", "纺月的夜歌", "昔时之歌", "千岩牢固", "流放者",
    "如雷的盛怒", "平息鸣雷的尊者", "奇迹", "游医", "未竟的遐思", "辰砂往生录", "翠绿之影",
    "花海甘露之光", "流浪大地的乐团"]

var ATTR_NAMES = ['生命值', '元素精通', '暴击率', '暴击伤害', '防御力', '攻击力', '元素充能效率']

var STAR_3_SET_TYPE = ["冒险家", "幸运儿", "游医"]
var STAR_4_SET_TYPE = ["祭水之人", "祭火之人", "祭雷之人", "祭冰之人", "学士", "赌徒", "武人", "战狂", "流放者", "行者之心", "奇迹", "守护之心", "勇士之心"]
